In [1]:
#import the numpy and pandas
import numpy as np
import pandas as pd

In [5]:
#the lable to call series 
s= pd.Series(np.random.random(5), index=['a','b','c','d','e'])

In [6]:
s

a    0.572306
b    0.705616
c    0.530259
d    0.870662
e    0.165517
dtype: float64

In [7]:
type(s)

pandas.core.series.Series

In [8]:
s.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [9]:
pd.Series(np.random.randn(5))

0   -0.775979
1   -0.247767
2    0.953580
3    0.713268
4   -0.160697
dtype: float64

In [12]:
#from dict: Series can be instantiated from dicts:
d = {'a':1, 'b':2, 'c':3,'d':4}
pd.Series(d)

a    1
b    2
c    3
d    4
dtype: int64

In [13]:
pd.Series(d, index=['b','c','a','d'])

b    2
c    3
a    1
d    4
dtype: int64

In [14]:
pd.Series(5., index=['a','b','c'])

a    5.0
b    5.0
c    5.0
dtype: float64

In [15]:
s[0]

0.5723056822990179

In [16]:
s[s>s.median()]

b    0.705616
d    0.870662
dtype: float64

In [17]:
s['a']

0.5723056822990179

In [18]:
'e' in s

True

In [19]:
'd' in s

True

In [20]:
'f' in s

False

In [28]:
s.get('f')
s.get('d' , np.nan)

0.870661508025347

In [32]:
np.exp(s)

a    1.772349
b    2.025093
c    1.699372
d    2.388490
e    1.180003
dtype: float64

In [38]:
s2= s.rename("different")
s2

a    0.572306
b    0.705616
c    0.530259
d    0.870662
e    0.165517
Name: different, dtype: float64

In [44]:
#Dataframe: two dimentional data type 
d ={'one': pd.Series([1.,2.,3.],index=['a','b','c']),
     'two':pd.Series([1.,2.,3.,4.], index=['a','b','c','d'])}

In [47]:
df = pd.DataFrame(d)
df

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  NaN  4.0

In [55]:
df = pd.DataFrame(d, index=['b','d','a'])
df

   one  two
b  2.0  2.0
d  NaN  4.0
a  1.0  1.0

In [57]:
df = pd.DataFrame(d, index=['b','d','a'], columns=["two", "one"])
df

   two  one
b  2.0  2.0
d  4.0  NaN
a  1.0  1.0

In [59]:
df.index

Index(['b', 'd', 'a'], dtype='object')

In [60]:
df.columns

Index(['two', 'one'], dtype='object')

In [66]:
df = {'one': [1.,2.,3.,4.],
      'two': [2.,3.,4.]}
type(df)

dict

In [68]:
pd.DataFrame(d)

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  NaN  4.0

In [70]:
s = pd.Series([1,3,4,5,np.nan, 9])
s

0    1.0
1    3.0
2    4.0
3    5.0
4    NaN
5    9.0
dtype: float64

In [73]:
#Creating a DataFrame by passing a NumPy array, with a datetime index and labeled columns:
dates = pd.date_range('20130101', periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [75]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01 -0.727155  0.956470  0.147722  0.463355
2013-01-02 -0.463830 -1.288760  0.452512 -0.212081
2013-01-03  0.032663 -0.720773 -0.034413 -0.185565
2013-01-04 -1.816468 -0.318889 -0.025147  0.193627
2013-01-05  0.929672  0.515965 -0.617103  0.300150
2013-01-06  0.126333 -2.158011  0.700766 -0.667213

In [84]:
#Creating a DataFrame by passing a dict of objects that can be converted to series-like.
df2 = pd.DataFrame({'A':1.,
                   'B': pd.Timestamp('20130102'),
                   'C': pd.Series(1, index=list(range(4)),dtype='float32'),
                   'D': np.array([3] *4, dtype = 'int32'),
                   'E': pd.Categorical(["test", "trai", "test","train"]),
                   'F': 'foo'})

In [87]:
type(df2)

pandas.core.frame.DataFrame

In [88]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [91]:
df.head(2)

                   A        B         C         D
2013-01-01 -0.727155  0.95647  0.147722  0.463355
2013-01-02 -0.463830 -1.28876  0.452512 -0.212081

In [92]:
df.tail(1)

                   A         B         C         D
2013-01-06  0.126333 -2.158011  0.700766 -0.667213

In [93]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [95]:
df2.tail(2)

     A          B    C  D      E    F
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [96]:
df2.head(1)

     A          B    C  D     E    F
0  1.0 2013-01-02  1.0  3  test  foo

In [98]:
df2.columns

Index(['A', 'B', 'C', 'D', 'E', 'F'], dtype='object')

In [99]:
df2.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'trai', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

In [101]:
#Describe() function will show quick statistic summary :
df2.describe().T

   count  mean  std  min  25%  50%  75%  max
A    4.0   1.0  0.0  1.0  1.0  1.0  1.0  1.0
C    4.0   1.0  0.0  1.0  1.0  1.0  1.0  1.0
D    4.0   3.0  0.0  3.0  3.0  3.0  3.0  3.0

In [106]:
df2.sort_values(by='B')

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3   trai  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [107]:
df2['A']

0    1.0
1    1.0
2    1.0
3    1.0
Name: A, dtype: float64

In [108]:
df2[0:2]

     A          B    C  D     E    F
0  1.0 2013-01-02  1.0  3  test  foo
1  1.0 2013-01-02  1.0  3  trai  foo

In [109]:
df2.iloc[3]

A                      1
B    2013-01-02 00:00:00
C                      1
D                      3
E                  train
F                    foo
Name: 3, dtype: object

In [110]:
df2.iloc[1]

A                      1
B    2013-01-02 00:00:00
C                      1
D                      3
E                   trai
F                    foo
Name: 1, dtype: object

In [111]:
def hello_function():
    print("hello world!")

In [113]:
hello_function()

hello world!